NicPare/GBM2100/Laboratoire3.cydsn/Generated_Source/PSoC6/CapSense_1_Configuration.h
/*******************************************************************************
* CSD Specific settings
*******************************************************************************/

/* CSD scan method settings */
#define CapSense_1_CSD_IDAC_AUTOCAL_EN          (1u)
#define CapSense_1_CSD_IDAC_GAIN                (CapSense_1_IDAC_GAIN_HIGH)
#define CapSense_1_CSD_SHIELD_EN                (0u)
#define CapSense_1_CSD_SHIELD_TANK_EN           (0u)
#define CapSense_1_CSD_CSH_PRECHARGE_SRC        (CapSense_1_CSH_PRECHARGE_VREF)
#define CapSense_1_CSD_SHIELD_DELAY             (CapSense_1_NO_DELAY)
#define CapSense_1_CSD_TOTAL_SHIELD_COUNT       (0u)
#define CapSense_1_CSD_SCANSPEED_DIVIDER        (2u)
#define CapSense_1_CSD_COMMON_SNS_CLK_EN        (0u)
#define CapSense_1_CSD_SNS_CLK_SOURCE           (CapSense_1_CLK_SOURCE_PRSAUTO)
#define CapSense_1_CSD_SNS_CLK_DIVIDER          (4u)
#define CapSense_1_CSD_INACTIVE_SNS_CONNECTION  (CapSense_1_SNS_CONNECTION_GROUND)
#define CapSense_1_CSD_IDAC_COMP_EN             (1u)
#define CapSense_1_CSD_IDAC_CONFIG              (CapSense_1_IDAC_SOURCING)
#define CapSense_1_CSD_RAWCOUNT_CAL_LEVEL       (85u)
#define CapSense_1_CSD_DUALIDAC_LEVEL           (50u)
#define CapSense_1_CSD_PRESCAN_SETTLING_TIME    (5u)
#define CapSense_1_CSD_SNSCLK_R_CONST           (1000u)
#define CapSense_1_CSD_VREF_MV                  (2133u)

/* CSD settings */
#define CapSense_1_CSD_ANALOG_STARTUP_DELAY_US  (23u)
#define CapSense_1_CSD_FINE_INIT_TIME           (10u)
#define CapSense_1_CSD_DEDICATED_IDAC_COMP_EN   (1u)
#define CapSense_1_CSD_AUTO_ZERO_EN             (0u)
#define CapSense_1_CSD_AUTO_ZERO_TIME           (15Lu)
#define CapSense_1_CSD_NOISE_METRIC_EN          (0u)
#define CapSense_1_CSD_NOISE_METRIC_TH          (1Lu)
#define CapSense_1_CSD_INIT_SWITCH_RES          (CapSense_1_INIT_SW_RES_MEDIUM)
#define CapSense_1_CSD_SENSING_METHOD           (0)
#define CapSense_1_CSD_SHIELD_SWITCH_RES        (CapSense_1_SHIELD_SW_RES_MEDIUM)
#define CapSense_1_CSD_GAIN                     (11Lu)

#define CapSense_1_CSD_F1PM_SWITCH_RES_LE_INIT     (1)
#define CapSense_1_CSD_F1PM_SWITCH_RES_LE_SCAN     (0)
#define CapSense_1_CSD_F2PT_SWITCH_RES_LE_INIT     (1)
#define CapSense_1_CSD_F2PT_SWITCH_RES_LE_SCAN     (0)
#define CapSense_1_CSD_HCAG_SWITCH_RES_LE_INIT     (1)
#define CapSense_1_CSD_HCAG_SWITCH_RES_LE_SCAN     (3)
#define CapSense_1_CSD_HCAV_SWITCH_RES_LE_INIT     (1)
#define CapSense_1_CSD_HCAV_SWITCH_RES_LE_SCAN     (0)
#define CapSense_1_CSD_HCBG_SWITCH_RES_LE_INIT     (1)
#define CapSense_1_CSD_HCBG_SWITCH_RES_LE_SCAN     (3)
#define CapSense_1_CSD_HCBV_SWITCH_RES_LE_INIT     (1)
#define CapSense_1_CSD_HCBV_SWITCH_RES_LE_SCAN     (3)

#define CapSense_1_CSD_SENSE_WIDTH_LE              (10)

#define CapSense_1_CSD_MFS_DIVIDER_OFFSET_F1       (1u)
#define CapSense_1_CSD_MFS_DIVIDER_OFFSET_F2       (2u)

/*******************************************************************************
* CSX Specific settings
*******************************************************************************/

/* CSX scan method settings */
#define CapSense_1_CSX_SCANSPEED_DIVIDER        (2u)
#define CapSense_1_CSX_COMMON_TX_CLK_EN         (0u)
#define CapSense_1_CSX_TX_CLK_SOURCE            (CapSense_1_CLK_SOURCE_PRSAUTO)
#define CapSense_1_CSX_TX_CLK_DIVIDER           (167u)
#define CapSense_1_CSX_MAX_FINGERS              (1u)
#define CapSense_1_CSX_MAX_LOCAL_PEAKS          (5u)
#define CapSense_1_CSX_IDAC_AUTOCAL_EN          (0u)
#define CapSense_1_CSX_IDAC_BITS_USED           (7u)
#define CapSense_1_CSX_RAWCOUNT_CAL_LEVEL       (40u)
#define CapSense_1_CSX_IDAC_GAIN                (CapSense_1_IDAC_GAIN_MEDIUM)
#define CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES (0u)
#define CapSense_1_CSX_MULTIPHASE_TX_EN         (0u)
#define CapSense_1_CSX_MAX_TX_PHASE_LENGTH      (0u)

/* CSX settings */
#define CapSense_1_CSX_ANALOG_STARTUP_DELAY_US  (23u)
#define CapSense_1_CSX_AUTO_ZERO_EN             (0u)
#define CapSense_1_CSX_AUTO_ZERO_TIME           (15u)
#define CapSense_1_CSX_FINE_INIT_TIME           (4u)
#define CapSense_1_CSX_NOISE_METRIC_EN          (0u)
#define CapSense_1_CSX_NOISE_METRIC_TH          (1u)
#define CapSense_1_CSX_INIT_SWITCH_RES          (CapSense_1_INIT_SW_RES_MEDIUM)
#define CapSense_1_CSX_SCAN_SWITCH_RES          (CapSense_1_SCAN_SW_RES_LOW)
#define CapSense_1_CSX_INIT_SHIELD_SWITCH_RES   (CapSense_1_INIT_SHIELD_SW_RES_HIGH)
#define CapSense_1_CSX_SCAN_SHIELD_SWITCH_RES   (CapSense_1_SCAN_SHIELD_SW_RES_LOW)

#define CapSense_1_CSX_MFS_DIVIDER_OFFSET_F1    (1u)
#define CapSense_1_CSX_MFS_DIVIDER_OFFSET_F2    (2u)

/* Gesture parameters */
#define CapSense_1_GES_GLOBAL_EN                (0u)


/*******************************************************************************
* Global Parameter Definitions
*******************************************************************************/

/* RAM Global Parameters Definitions */
#define CapSense_1_CONFIG_ID                    (0x6282u)
#define CapSense_1_DEVICE_ID                    (0x0900u)
#define CapSense_1_HW_CLOCK                     (0x30D4u)
#define CapSense_1_CSD0_CONFIG                  (0x0008u)

/*******************************************************************************
* DummyWidget initialization values for FLASH data structure
*******************************************************************************/
#define CapSense_1_DUMMYWIDGET_STATIC_CONFIG    (10241u)
#define CapSense_1_DUMMYWIDGET_NUM_SENSORS      (1u)

/*******************************************************************************
* DummyWidget initialization values for RAM data structure
*******************************************************************************/
#define CapSense_1_DUMMYWIDGET_RESOLUTION       (CapSense_1_RES12BIT)
#define CapSense_1_DUMMYWIDGET_FINGER_TH        (100u)
#define CapSense_1_DUMMYWIDGET_NOISE_TH         (40u)
#define CapSense_1_DUMMYWIDGET_NNOISE_TH        (40u)
#define CapSense_1_DUMMYWIDGET_HYSTERESIS       (10u)
#define CapSense_1_DUMMYWIDGET_ON_DEBOUNCE      (3u)
#define CapSense_1_DUMMYWIDGET_LOW_BSLN_RST     (30u)
#define CapSense_1_DUMMYWIDGET_IDAC_MOD0        (32u)
#define CapSense_1_DUMMYWIDGET_SNS_CLK          (4u)
#define CapSense_1_DUMMYWIDGET_SNS_CLK_SOURCE   (0u)
#define CapSense_1_DUMMYWIDGET_FINGER_CAP       (160u)
#define CapSense_1_DUMMYWIDGET_SIGPFC           (0u)

